[
  {
    "title": "Brotopia",
    "date": "2018/3",
    "link": "https://www.goodreads.com/book/show/36288143-brotopia",
    "author": "Emily Chang",
    "description": "Diversity in tech (or the lack thereof) is an often-discussed topic. This book still contributed some alarming evidence on how women continue to face a bias against them in a systematic manner inside the tech industry."
  },
  {
    "title": "Hillbilly Elegy",
    "date": "2018/3",
    "link": "https://www.goodreads.com/book/show/27161156-hillbilly-elegy",
    "author": "J.D Vance",
    "description": "A eye-opening memoir of the life of a man who grew up in the Rust Belt. Vance writes very simply, but it's so engrossing that I read the book cover-to-cover in one five-hour sitting. It's also refreshing to see him be critical of both government policies and also the societal culture that leads to disenfranchisement of poor whites in America."
  },
  {
    "title": "The Orphan Master's Son",
    "date": "2018/3",
    "link": "https://www.goodreads.com/book/show/11529868-the-orphan-master-s-son",
    "author": "Adam Johnson",
    "description": "A thrilling story of an orphan's life in North Korea. The book was based on a lot of research the author conducted on the DPRK. I thought the book started off a little slow, but the second half is an intense page-turner."
  },
  {
    "title": "Ad Click Prediction: a View from the Trenches",
    "date": "2018/3",
    "link": "https://research.google.com/pubs/pub41159.html",
    "author": "McMahon, Sculley et al (Research at Google)",
    "description": "The TL;DR on this paper is the FTRL (\"Follow The Regularized Leader\") algorithm, an alternative to online gradient descent that works especially well for datasets with large, sparse input features (ie. billions of dimensions, but only hundreds of nonzero values). I'm not very interested in ad click prediction per say, but more so in large-scale realtime systems and implementing ML mechanisms on streaming data. What I found especially interesting in this paper are the optimizations that are done for this to work at Google's scale (probabilistic feature inclusion, encoding values with 16 bits rather than 32/64 bits, etc). Lastly, I thought Google's automated feature management system is a great idea for how features (referred to as \"signals\" in the paper) can be shared and managed among different teams. This is especially useful for large companies with a distributed approach to investing in ML."
  },
  {
    "title": "Nonviolent Communication",
    "date": "2018/3",
    "link": "https://www.goodreads.com/book/show/71730.Nonviolent_Communication",
    "author": "Marshall B. Rosenberg",
    "description": "An interesting read about how to express yourself more fully, empathize with others more patiently and mediate conflicts more thoughtfully."
  },
  {
    "title": "Shoe Dog",
    "date": "2018/2",
    "link": "https://www.goodreads.com/book/show/27220736-shoe-dog",
    "author": "Phil Knight",
    "description": "An incredibly inspiring book that is humbly written. I cannot recommend it more highly. So many great quotes, but here's one: \"Life is growth. You grow or you die.\""
  },
  {
    "title": "Cassandra - A Decentralized Structured Storage System",
    "date": "2018/2",
    "link": "https://www.cs.cornell.edu/projects/ladis2009/papers/lakshman-ladis2009.pdf",
    "author": "Avinash Lakshman & Prashant Malik",
    "description": "I read this paper because I'm starting to use Cassandra at work. It's extremely interesting to read about the challenges that arise when developing distributed file systems and it reminded me of my fascination with distributed systems during college. Lastly, I love to see research sparked by industry needs (Cassandra was developed at Facebook to solve Inbox Search)."
  },
  {
    "title": "The Amazing Adventures of Kavalier & Clay",
    "date": "2018/1",
    "link": "https://www.goodreads.com/book/show/3985.The_Amazing_Adventures_of_Kavalier_Clay", "author": "Alex Graves",
    "author": "Michael Chabon",
    "description": "A thrilling book based on the lives of two boys producing comic books in New York City during the Second World War. Extremely-well written, would highly recommend."
  },
  {
    "title": "Supervised Sequence Labelling with Recurrent Neural Networks",
    "date": "2017/12",
    "link": "https://www.cs.toronto.edu/~graves/phd.pdf",
    "author": "Alex Graves",
    "description": "I've only read the first 30 pages of Alex Graves' PhD thesis, but it's been a very clear and concise introduction to neural networks. I'd recommend it to anyone who has a shallow background in ML and wants to learn about neural nets."
  },
  {
    "title": "the sellout",
    "date": "2017/11",
    "link": "https://www.goodreads.com/book/show/22237161-the-sellout",
    "author": "Paul Beatty",
    "description": "This is the first book by an American author to win a Man Booker. A very interesting work of satire. There were definitely some references which I did not understand, but Beatty writes beautifully (there were a number of times I paused reading to appreciate the literature)."
  },
  {
    "title": "the emperor of all maladies",
    "date": "2017/11",
    "link": "https://www.goodreads.com/book/show/7170627-the-emperor-of-all-maladies",
    "author": "Siddhartha Mukherjee",
    "description": "A fascinating description of the history of cancer, through discovery, research and treatments. Even though Mukherjee does really well to make scientific topics more accessible to non-technical readers, I think you'd get a little more out of the book if you have a background in biology (which I do not). Still a highly recommended read."
  },
  {
    "title": "on finding your purpose",
    "date": "2016/07",
    "link": "http://tranquilmonkey.com/hunter-s-thompsons-extraordinary-letter-on-finding-your-purpose/",
    "author": "Hunter S. Thompson"
  },
  {
    "title": "a couple in chicago",
    "date": "2016/03",
    "link": "https://www.newyorker.com/magazine/2009/01/19/a-couple-in-chicago",
    "author": "Mariana Cook"
  },
  {
    "title": "why people cheat",
    "date": "2016/02",
    "link": "https://www.washingtonpost.com/news/wonk/wp/2016/02/08/why-winners-become-cheaters/?utm_term=.e73217692f1d",
    "author": "Roberto A. Ferdman"
  }
]
